Revit 2024 API
BalusterPlacement.PostPattern Property
 Accesses the object containing properties related to the post pattern.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public PostPattern PostPattern { get; }
Visual Basic
Public ReadOnly Property PostPattern As PostPattern
	Get
Visual C++
public:
property PostPattern^ PostPattern {
	PostPattern^ get ();
}
See Also
BalusterPlacement Class
Autodesk.Revit.DB.Architecture Namespace